# 提示词优化案例——金融信息抽取


# 1 获取client对象
from openai import OpenAI
import json
import os

client = OpenAI(
    # 如果没有配置环境变量，请用阿里云百炼API Key替换：api_key="sk-xxx"
    api_key=os.getenv("OPENAI_API_KEY"),
    base_url="https://dashscope.aliyuncs.com/compatible-mode/v1",
)

# 元数据： 数据结构
schema = ['日期', '股票名称', '开盘价', '收盘价', '成交量']

# 样本数据
example_data = [
    {
        "content":"2023-01-10， 股市震荡。强大科技A股今日开盘价100人民币，一度飙升到105人民币，随后回落至98美元，最终以102美元收盘，成交量达到520000。",
        "answers":{
            "日期":"2023-01-10",
            "股票名称":"强大科技A股",
            "开盘价":"100人民币",
            "收盘价":"102人民币",
            "成交量":"520000"
        }
    },
    {
        "content": "2024-05-16， 股市利好。英伟达美股今日开盘价105美元，一度飙升到109美元，随后回落至100美元，最终以116美元收盘，成交量达到3560000。",
        "answers": {
            "日期": "2024-05-16",
            "股票名称": "英伟达美股",
            "开盘价": "105美元",
            "收盘价": "116没有",
            "成交量": "3560000"
        }
    }
]
# 问题列表
questions = [
    "2026-02-25, 股市利好。股票传智播客A股开盘价66人民币，一度飙升到77人民币，随后回落至65人民币，最终以68人民币收盘，成交量达到1230000。",
    "2026-02-26, 股市利好。股票黑马程序员A股开盘价200人民币，一度飙升到211人民币，随后回落至201人民币，最终以206人民币收盘。"
]

# 提示词设计
"""
[
    {"role":"system", "content":f"你帮我完成信息抽取，我给你句子，你抽取{schema}信息，按json字符串输出，如果某些信息部存在，用'原文未提及'表示，请参考如下示例："}, 
    
    {"role":"user", "content":"2023-01-10， 股市震荡。强大科技A股今日开盘价100人民币，一度飙升到105人民币，随后回落至98美元，最终以102美元收盘，成交量达到520000。"},
    {"role":"assistant", "{'日期':'2023-01-10', '股票名称':'强大科技A股',  '开盘价':'100人民币', '收盘价':'102人民币', '成交量':'520000'}"},
    
    {"role":"user", "content":"2024-05-16， 股市利好。英伟达美股今日开盘价105美元，一度飙升到109美元，随后回落至100美元，最终以116美元收盘，成交量达到3560000。"},
    {"role":"assistant", "{'日期':'2024-05-16', '股票名称':'英伟达美股',  '开盘价':'105美元', '收盘价':'116美元', '成交量':'3560000'}"},
    
     {"role":"user", "content":"按照上述例子，现在抽取这个句子的信息：{要抽取的句子文本}"},
]
"""

# 构建提示词
messages = [
    {"role":"system", "content":f"你帮我完成信息抽取，我给你句子，你抽取{schema}信息，按json字符串输出，如果某些信息部存在，用'原文未提及'表示，请参考如下示例："}
]
for example in example_data:
    messages.append(
        {"role":"user", "content":example["content"]}
    )
    messages.append(
        {"role": "assistant", "content": json.dumps(example["answers"], ensure_ascii=False)}
    )

for x in messages:
    print(x)

print("\n\n========== 追加用户的提问，并发送给大模型")
# 追加用户的提问
for question in questions:
    response = client.chat.completions.create(
        model="qwen3-max",
        messages=messages + [{"role":"user", "content": f"按照上述示例，抽取下面这个句子的信息：{question}"}]
    )
    # 打印模型回复信息：
    print("\n大模型回复：", response.choices[0].message.content)

# 大模型回复： {"日期": "2026-02-25", "股票名称": "传智播客A股", "开盘价": "66人民币", "收盘价": "68人民币", "成交量": "1230000"}
# 大模型回复： {"日期": "2026-02-26", "股票名称": "黑马程序员A股", "开盘价": "200人民币", "收盘价": "206人民币", "成交量": "原文未提及"}

